#+title: Client Server Socket Example
#+author: Marcus Birkenkrahe (pledged)
#+SEQ_TODO: TODO NEXT IN_PROGRESS | DONE
#+startup: overview hideblocks indent entitiespretty:
#+property: header-args:C :main yes :includes <stdio.h> :results output :exports both:
#+property: header-args:python :session *Python* :python python3 :results output :exports both:
#+property: header-args: R :session *R* :results output :exports both:
#+property: header-args:C++ :main yes :includes <iostream> :results output :exports both:
* Create TCP client socket

- Include standard header files:
  #+name: standard header files
  #+begin_src C :results none
    #include <stdio.h>
    #include <stdlib.h>
  #+end_src

- Include several special header files
  #+name: network header files
  #+begin_src C :results none
    #include <sys/types.h>
    #include <sys/socket.h>
    #include <netinet/in.h>
    #include <unistd.h>
  #+end_src

- *Challenge:* Where exactly are these files on your Linux system? Find
  out and let's share in the next session.

- Main program:
  #+begin_src C :noweb yes :tangle tcp_client.c :includes :main no
    <<standard header files>>
    <<network header files>>

    #define PORT 9002

    int main(void)
    {
      // redirect stderr to stdout
      dup2(1,2);  // same as 1&>2 on the shell

      // create socket
      int network_socket;

      // use IPv4, TCP, default for the socket
      network_socket = socket(AF_INET, SOCK_STREAM, 0);

      // specify a destination address for the socket
      struct sockaddr_in server_address;
      server_address.sin_family = AF_INET; // use IPv4
      server_address.sin_port = htons(PORT); // convert port number
      server_address.sin_addr.s_addr = INADDR_ANY; // use 0.0.0.0

      // connect to the socket
      int connection_status = // return 0 if OK, or -1 if not OK
        connect(network_socket,
                (struct sockaddr *) &server_address,
                sizeof(server_address));

      // check for error (no connection)
      if (connection_status == -1) {
        perror("Connection error");  // perror prints to stderr
      }

      // receive data from the server
      char server_response[250]; // empty string to hold the data
      recv(network_socket, // this is the socket we created
           &server_response,
           sizeof(server_response),
           0);

      // print the data that we received
      if (connection_status == 0) { // if we could get a connection
        printf("The server sent the data: %s", server_response);
      }
      // close the socket
      close(network_socket);

      return 0;
    }
  #+end_src

  #+RESULTS:
  : Connection error: Connection refused

- To test, run this and you should get the output =Connection error.=

